In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({
    'phong': ['kt', 'ns', 'bh', 'mk'],
    'luong': ['20,000,000vnđ', '18,000,000đ', '18500000', '12,000,000VNĐ']
})
df

  phong          luong
0    kt  20,000,000vnđ
1    ns    18,000,000đ
2    bh       18500000
3    mk  12,000,000VNĐ

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   phong   4 non-null      object
 1   luong   4 non-null      object
dtypes: object(2)
memory usage: 192.0+ bytes

In [6]:
df['luong'] = df['luong'].str.lower()
df['luong'] = df['luong'].str.replace(',', '')
df['luong'] = df['luong'].str.replace('vnđ', '')
df['luong'] = df['luong'].str.replace('đ', '')
df['luong'] = df['luong'].astype(int)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   phong   4 non-null      object
 1   luong   4 non-null      int32
dtypes: int32(1), object(1)
memory usage: 176.0+ bytes

In [7]:
df

  phong     luong
0    kt  20000000
1    ns  18000000
2    bh  18500000
3    mk  12000000

In [8]:
df2 = pd.DataFrame({
    'phong': ['kt', 'ns', 'bh', 'mk'],
    'luong': ['20,000,000vnđ', '18,000,000đ', '18500000', '12,000,000VNĐ']
})
df2

  phong          luong
0    kt  20,000,000vnđ
1    ns    18,000,000đ
2    bh       18500000
3    mk  12,000,000VNĐ

In [9]:
df2['luong'] = df2['luong'].str.replace('\D', '').astype(int)
df2

  phong     luong
0    kt  20000000
1    ns  18000000
2    bh  18500000
3    mk  12000000

In [10]:
df3 = pd.DataFrame({
    'phong': ['kt', 'ns', 'bh', 'mk'],
    'luong': ['20,000,000vnđ', '18,000,000đ', '18500000', '12,000,000VNĐ']
})
df3

  phong          luong
0    kt  20,000,000vnđ
1    ns    18,000,000đ
2    bh       18500000
3    mk  12,000,000VNĐ

In [11]:
df3['luong'] = df3['luong'].str.replace('\D', '')
df3['luong'] = pd.to_numeric(df3['luong'])
df3

  phong     luong
0    kt  20000000
1    ns  18000000
2    bh  18500000
3    mk  12000000

In [12]:
df4 = pd.DataFrame({
    'phong': ['kt', 'ns', 'bh', 'mk'],
    'luong': ['20,000,000vnđ', '18,000,000đ', '18500000', '12,000,000VNĐ']
})
df4

  phong          luong
0    kt  20,000,000vnđ
1    ns    18,000,000đ
2    bh       18500000
3    mk  12,000,000VNĐ

In [16]:
df4['luong_num'] = pd.to_numeric(df4['luong'], errors='coerce')
df4

  phong          luong   luong_num
0    kt  20,000,000vnđ         NaN
1    ns    18,000,000đ         NaN
2    bh       18500000  18500000.0
3    mk  12,000,000VNĐ         NaN

## category type

In [17]:
import seaborn as sns

In [18]:
df5 = sns.load_dataset('titanic')
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [19]:
df5['sex'].unique()

array(['male', 'female'], dtype=object)

In [20]:
df5['sex'] = df5['sex'].astype('category')
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    category
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(3), float64(2), int64(4), object(4)
memory usage: 74.6+ KB

In [21]:
df5['pclass'] = df5['pclass'].astype('category')
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    category
 2   sex          891 non-null    category
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(4), float64(2), int64(3), object(4)
memory usage: 68.7+ KB

## dùng extract kết hợp regular expression

In [24]:
df6 = pd.DataFrame({
    'info': ['kt-2-20000000', 'ns-4-24000000', 'bh-10-30000000']
})
df6

             info
0   kt-2-20000000
1   ns-4-24000000
2  bh-10-30000000

In [25]:
df6['phong'] = df6['info'].str.extract('(\w{2})', expand=False)
df6

             info phong
0   kt-2-20000000    kt
1   ns-4-24000000    ns
2  bh-10-30000000    bh

In [29]:
df6['sonv'] = df6['info'].str.extract('(\d{1,2})', expand=False)
df6

             info phong sonv
0   kt-2-20000000    kt    2
1   ns-4-24000000    ns    4
2  bh-10-30000000    bh   10

In [30]:
df6['doanhthu'] = df6['info'].str.extract('(\d{8})', expand=False)
df6

             info phong sonv  doanhthu
0   kt-2-20000000    kt    2  20000000
1   ns-4-24000000    ns    4  24000000
2  bh-10-30000000    bh   10  30000000

## chuỗi phương thức

In [41]:
df7 = pd.DataFrame({
    'phong': ['kt', 'ns', 'bh', 'mk'],
    'luong': ['20,000,000vnđ', '18,000,000đ', '18500000', '12,000,000VNĐ']
})
df7

  phong          luong
0    kt  20,000,000vnđ
1    ns    18,000,000đ
2    bh       18500000
3    mk  12,000,000VNĐ

In [33]:
df7['luong'] = df7['luong'].str.lower()
df7['luong'] = df7['luong'].str.replace(',', '')
df7['luong'] = df7['luong'].str.replace('vnđ', '')
df7['luong'] = df7['luong'].str.replace('đ', '')
df7['luong'] = df7['luong'].astype(int)
df7

  phong     luong
0    kt  20000000
1    ns  18000000
2    bh  18500000
3    mk  12000000

In [42]:
df7['luong'] = df7['luong'].str.lower().str.replace(',', '').str.replace('vnđ', '')\
                .str.replace('đ', '').astype(int)
df7

  phong     luong
0    kt  20000000
1    ns  18000000
2    bh  18500000
3    mk  12000000

## remove duplicate

In [43]:
df8 = pd.DataFrame({
    'A': ['foo', 'foo', 'foo', 'bar'],
    'B': [0, 1, 1, 1],
    'C': ['A', 'A', 'B', 'A']
})
df8

     A  B  C
0  foo  0  A
1  foo  1  A
2  foo  1  B
3  bar  1  A

In [44]:
df8_new1 = df8.drop_duplicates()
df8_new1

     A  B  C
0  foo  0  A
1  foo  1  A
2  foo  1  B
3  bar  1  A

In [45]:
df8_new2 = df8.drop_duplicates(subset=['A', 'C'])
df8_new2

     A  B  C
0  foo  0  A
2  foo  1  B
3  bar  1  A

In [46]:
df8_new3 = df8.drop_duplicates(subset=['A', 'C'], keep='last')
df8_new3

     A  B  C
1  foo  1  A
2  foo  1  B
3  bar  1  A

In [47]:
df8_new4 = df8.drop_duplicates(subset=['A', 'C'], keep=False)
df8_new4

     A  B  C
2  foo  1  B
3  bar  1  A

## xử lý giá trị null

In [61]:
df8 = pd.DataFrame({
    'A': ['foo', 'foo', 'foo', np.nan, 'bar'],
    'B': [0, 1, 1, np.nan, np.nan],
    'C': ['A', 'A', 'B', np.nan, 'A'],
    'D': [30, np.nan, 22, np.nan, 29.5],
    'E': [np.nan, np.nan, np.nan, np.nan, np.nan]
})
df8

     A    B    C     D   E
0  foo  0.0    A  30.0 NaN
1  foo  1.0    A   NaN NaN
2  foo  1.0    B  22.0 NaN
3  NaN  NaN  NaN   NaN NaN
4  bar  NaN    A  29.5 NaN

In [62]:
# xóa các cột mà tất cả các giá trị đều là NaN
# df8 = df8.dropna(axis = 1, how='all')
df8.dropna(axis = 1, how='all', inplace=True)
df8

     A    B    C     D
0  foo  0.0    A  30.0
1  foo  1.0    A   NaN
2  foo  1.0    B  22.0
3  NaN  NaN  NaN   NaN
4  bar  NaN    A  29.5

In [63]:
# xóa các dòng mà tất cả các giá trị đều là NaN
# df8 = df8.dropna(axis = 0, how='all')
df8.dropna(axis = 0, how='all', inplace=True)
df8

     A    B  C     D
0  foo  0.0  A  30.0
1  foo  1.0  A   NaN
2  foo  1.0  B  22.0
4  bar  NaN  A  29.5

In [54]:
df8_a = df8.fillna(0)
df8_a

     A    B  C     D
0  foo  0.0  A  30.0
1  foo  1.0  A   0.0
2  foo  1.0  B  22.0
4  bar  0.0  A  29.5

In [57]:
df8['B'].mode()[0]

1.0

In [58]:
df8_b = df8
df8_b['B'] = df8_b['B'].fillna(df8_b['B'].mode()[0])
df8_b

     A    B  C     D
0  foo  0.0  A  30.0
1  foo  1.0  A   NaN
2  foo  1.0  B  22.0
4  bar  1.0  A  29.5

In [59]:
df8_b['D'] = df8_b['D'].fillna(df8_b['D'].mean())
df8_b

     A    B  C          D
0  foo  0.0  A  30.000000
1  foo  1.0  A  27.166667
2  foo  1.0  B  22.000000
4  bar  1.0  A  29.500000

In [64]:
df8

     A    B  C     D
0  foo  0.0  A  30.0
1  foo  1.0  A   NaN
2  foo  1.0  B  22.0
4  bar  NaN  A  29.5

In [66]:
mode_B = df8['B'].mode()[0]
mean_D = df8['D'].mean()
df8 = df8.fillna(value={'B': mode_B, 'D': mean_D})
df8

     A    B  C          D
0  foo  0.0  A  30.000000
1  foo  1.0  A  27.166667
2  foo  1.0  B  22.000000
4  bar  1.0  A  29.500000